<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>CellType</key>
	<string>Menu</string>
	<key>Domain</key>
	<string>com.apple.configurationprofile.identification</string>
	<key>Description</key>
	<string>Not Configured</string>
	<key>Title</key>
	<string>Identification</string>
	<key>IconName</key>
	<string>MenuIconIdentification.png</string>
	<key>PayloadKeys</key>
	<array>
		<dict>
			<key>Identifier</key>
			<string>7FA93154-5F79-44B8-A51F-099FDD5CB2CB</string>
			<key>Title</key>
			<string>User Display Name</string>
			<key>PayloadType</key>
			<string>com.apple.configurationprofile.identification</string>
			<key>PayloadKey</key>
			<string>FullName</string>
			<key>Description</key>
			<string>The user display name for the accounts</string>
			<key>CellType</key>
			<string>TextField</string>
			<key>ToolTipDescription</key>
			<string>The full name of the designated accounts</string>
		</dict>
		<dict>
			<key>Identifier</key>
			<string>7FDE577D-4153-4D1A-854F-CF880DD09ACC</string>
			<key>Title</key>
			<string>Email Address</string>
			<key>PayloadType</key>
			<string>com.apple.configurationprofile.identification</string>
			<key>PayloadKey</key>
			<string>EmailAddress</string>
			<key>Description</key>
			<string>The email address for the accounts</string>
			<key>CellType</key>
			<string>TextField</string>
			<key>ToolTipDescription</key>
			<string>The address for the accounts</string>
		</dict>
		<dict>
			<key>Identifier</key>
			<string>42371809-A98D-4680-A1F2-469125EBC282</string>
			<key>Title</key>
			<string>User Name</string>
			<key>PayloadType</key>
			<string>com.apple.configurationprofile.identification</string>
			<key>PayloadKey</key>
			<string>UserName</string>
			<key>Description</key>
			<string>The user name for the accounts</string>
			<key>CellType</key>
			<string>TextField</string>
			<key>ToolTipDescription</key>
			<string>The UNIX user name for the accounts</string>
		</dict>
		<dict>
			<key>Identifier</key>
			<string>43FCCF50-C508-4EAC-87BB-173F37072AFB</string>
			<key>Title</key>
			<string>Password</string>
			<key>PayloadType</key>
			<string>com.apple.configurationprofile.identification</string>
			<key>PayloadKey</key>
			<string>Password</string>
			<key>Description</key>
			<string>The password for the accounts</string>
			<key>CellType</key>
			<string>TextField</string>
			<key>ToolTipDescription</key>
			<string>You can provide the password or choose to have the user provide it when he or she installs the profile</string>
		</dict>
		<dict>
			<key>Identifier</key>
			<string>9CE67A26-6255-4A05-9EC2-5260162F1EFB</string>
			<key>Title</key>
			<string>User Enters Password</string>
			<key>PayloadType</key>
			<string>com.apple.configurationprofile.identification</string>
			<key>PayloadKey</key>
			<string>CHANGEME</string>
			<key>PayloadValueType</key>
			<string>Boolean</string>
			<key>Description</key>
			<string>The user enters the password upon profile installation</string>
			<key>DefaultValue</key>
			<false/>
			<key>CellType</key>
			<string>Checkbox</string>
			<key>ToolTipDescription</key>
			<string>CHANGEME</string>
		</dict>
		<dict>
			<key>Identifier</key>
			<string>86BA7451-0E30-4213-8D88-F2F6ACBE422E</string>
			<key>Title</key>
			<string>Prompt</string>
			<key>PayloadType</key>
			<string>com.apple.configurationprofile.identification</string>
			<key>PayloadKey</key>
			<string>Prompt</string>
			<key>Description</key>
			<string>Pompt text for any of the above values</string>
			<key>CellType</key>
			<string>TextField</string>
			<key>ToolTipDescription</key>
			<string>CHANGEME</string>
		</dict>
		<dict>
			<key>Identifier</key>
			<string>FB292609-673D-485B-AC91-57494474A290</string>
			<key>Title</key>
			<string>Prompt Message</string>
			<key>PayloadType</key>
			<string>com.apple.configurationprofile.identification</string>
			<key>PayloadKey</key>
			<string>PromptMessage</string>
			<key>Description</key>
			<string>Additional descriptive text for the Prompt field</string>
			<key>CellType</key>
			<string>TextField</string>
			<key>ToolTipDescription</key>
			<string>CHANGEME</string>
		</dict>
	</array>
</dict>
</plist>
