<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Required</key>
	<true/>
	<key>CellType</key>
	<string>Menu</string>
	<key>Domain</key>
	<string>com.apple.general</string>
	<key>Description</key>
	<string>Mandatory</string>
	<key>Title</key>
	<string>General</string>
	<key>IconName</key>
	<string>MenuIconGeneral.png</string>
	<key>PayloadTypes</key>
	<array>
		<string>com.apple.profile</string>
		<string>com.apple.profileRemovalPassword</string>
	</array>
	<key>AllowMultiplePayloads</key>
	<false/>
	<key>ManifestContent</key>
	<array>
		<dict>
			<key>Identifier</key>
			<string>CD1A01D6-908D-49CD-BAD6-181B45CC6738</string>
			<key>Title</key>
			<string>Name</string>
			<key>Optional</key>
			<true/>
			<key>PayloadType</key>
			<string>com.apple.profile</string>
			<key>PayloadKey</key>
			<string>PayloadDisplayName</string>
			<key>Description</key>
			<string>Display name of the profile (shown on the device)</string>
			<key>CellType</key>
			<string>TextField</string>
			<key>ToolTipDescription</key>
			<string>A human-readable name for the profile payload. This name is displayed on the Detail screen. It does not have to be unique.</string>
		</dict>
		<dict>
			<key>Identifier</key>
			<string>E2E64509-BDE4-4743-8AE9-D46B76E0CDA8</string>
			<key>Optional</key>
			<true/>
			<key>Title</key>
			<string>Organization</string>
			<key>PayloadType</key>
			<string>com.apple.profile</string>
			<key>PayloadKey</key>
			<string>PayloadOrganization</string>
			<key>Description</key>
			<string>Name of the organization which created the profile</string>
			<key>CellType</key>
			<string>TextField</string>
			<key>ToolTipDescription</key>
			<string>A human-readable string containing the name of the organization that provided the profile.</string>
		</dict>
		<dict>
			<key>Identifier</key>
			<string>65377BE1-1799-40D8-93E7-4C7CB0E7B9B4</string>
			<key>Optional</key>
			<true/>
			<key>Title</key>
			<string>Description</string>
			<key>PayloadType</key>
			<string>com.apple.profile</string>
			<key>PayloadKey</key>
			<string>PayloadDescription</string>
			<key>Description</key>
			<string>Brief description of the contents or purpose of the profile</string>
			<key>CellType</key>
			<string>TextView</string>
			<key>ToolTipDescription</key>
			<string>A description of the profile, shown on the Detail screen for the profile. This should be descriptive enough to help the user decide whether to install the profile.</string>
		</dict>
		<dict>
			<key>Identifier</key>
			<string>C06F890D-3C4D-4149-8B1C-C49CBB64D0BC</string>
			<key>Optional</key>
			<true/>
			<key>Title</key>
			<string>Consent Message</string>
			<key>PayloadType</key>
			<string>com.apple.profile</string>
			<key>PayloadKey</key>
			<string>ConsentText</string>
			<key>Description</key>
			<string>A message that will be displayed during profile installation</string>
			<key>CellType</key>
			<string>TableView</string>
			<key>TableViewColumns</key>
			<array>
				<dict>
					<key>Identifier</key>
					<string>9521F473-62B1-4212-8E94-7120341F1C6F</string>
					<key>Title</key>
					<string>Language ID</string>
					<key>DictType</key>
					<string>Key</string>
					<key>CellType</key>
					<string>TableViewTextField</string>
				</dict>
				<dict>
					<key>Identifier</key>
					<string>8D49A53D-985B-417A-BD64-C600AA9D5867</string>
					<key>Title</key>
					<string>Message</string>
					<key>DictType</key>
					<string>Value</string>
					<key>CellType</key>
					<string>TableViewTextField</string>
				</dict>
			</array>
			<key>ToolTipDescription</key>
			<string>A message that will be displayed during profile installation</string>
		</dict>
		<dict>
			<key>Identifier</key>
			<string>7106197F-1F9F-4A3A-B605-310BAB552065</string>
			<key>Title</key>
			<string>Security</string>
			<key>PayloadType</key>
			<string>com.apple.profile</string>
			<key>PayloadKey</key>
			<string>PayloadRemovalDisallowed</string>
			<key>PayloadValueType</key>
			<string>Boolean</string>
			<key>DefaultValue</key>
			<string>Always</string>
			<key>Description</key>
			<string>Controls when the profile can be removed</string>
			<key>CellType</key>
			<string>PopUpButton</string>
			<key>AvailableValues</key>
			<array>
				<string>Always</string>
				<string>With Authorization</string>
				<string>Never</string>
			</array>
			<key>ValueKeys</key>
			<dict>
				<key>Always</key>
				<array>
					<dict>
						<key>PayloadValue</key>
						<false/>
					</dict>
				</array>
				<key>With Authorization</key>
				<array>
					<dict>
						<key>Identifier</key>
						<string>E0342E6C-10E1-425A-898B-076DF68D0280</string>
						<key>PayloadType</key>
						<string>com.apple.profileRemovalPassword</string>
						<key>PayloadKey</key>
						<string>RemovalPassword</string>
						<key>Description</key>
						<string>Authorization Password</string>
						<key>CellType</key>
						<string>TextFieldNoTitle</string>
						<key>ToolTipDescription</key>
						<string>Specifies the removal password for the profile</string>
					</dict>
				</array>
				<key>Never</key>
				<array>
					<dict>
						<key>PayloadValue</key>
						<true/>
					</dict>
				</array>
			</dict>
		</dict>
		<dict>
			<key>Identifier</key>
			<string>F0B3C075-D53B-4AC1-9C46-367D41260C90</string>
			<key>Title</key>
			<string>Automatically Remove Profile</string>
			<key>Description</key>
			<string>Settings for automatic profile removal</string>
			<key>DefaultValue</key>
			<string>Never</string>
			<key>AvailableValues</key>
			<array>
				<string>Never</string>
				<string>On date</string>
				<string>After interval</string>
			</array>
			<key>ValueKeys</key>
			<dict>
				<key>On date</key>
				<array>
					<dict>
						<key>Identifier</key>
						<string>F3D11C11-CD32-460A-805C-98F19D043CFA</string>
						<key>PayloadType</key>
						<string>com.apple.profile</string>
						<key>PayloadKey</key>
						<string>RemovalDate</string>
						<key>PayloadValueType</key>
						<string>Date</string>
						<key>Description</key>
						<string>Removal date</string>
						<key>IndentLeft</key>
						<true/>
						<key>MinValueOffsetDays</key>
						<integer>1</integer>
						<key>ShowDateInterval</key>
						<true/>
						<key>CellType</key>
						<string>DatePickerNoTitle</string>
						<key>ToolTipDescription</key>
						<string>The date on which the profile will be automatically removed.</string>
					</dict>
				</array>
				<key>After interval</key>
				<array>
					<dict>
						<key>Identifier</key>
						<string>EA6DB9D5-FD38-4C06-8E2B-EC1257845185</string>
						<key>PayloadType</key>
						<string>com.apple.profile</string>
						<key>PayloadKey</key>
						<string>DurationUntilRemoval</string>
						<key>PayloadValueType</key>
						<string>Float</string>
						<key>CellType</key>
						<string>TextFieldDaysHoursNoTitle</string>
						<key>ToolTipDescription</key>
						<string>Number of seconds until the profile is automatically removed. If the RemovalDate keys is present, whichever field yields the earliest date will be used.</string>
					</dict>
				</array>
			</dict>
			<key>CellType</key>
			<string>PopUpButton</string>
		</dict>
	</array>
</dict>
</plist>
