<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Availability</key>
	<array>
		<dict>
			<key>AvailabilityKey</key>
			<string>Self</string>
			<key>AvailabilityOS</key>
			<string>iOS</string>
			<key>Available</key>
			<false/>
		</dict>
	</array>
	<key>Domain</key>
	<string>com.apple.securityprivacy.osx</string>
	<key>Description</key>
	<string>FIXME</string>
	<key>Title</key>
	<string>Security &amp; Privacy (OS X)</string>
	<key>IconName</key>
	<string>MenuIconSecurityPrivacy.png</string>
	<key>PayloadTypes</key>
	<array>
		<string>com.apple.SubmitDiagInfo</string>
		<string>com.apple.MCX</string>
		<string>com.apple.preference.security</string>
		<string>com.apple.loginwindow</string>
		<string>com.apple.screensaver</string>
		<string>com.apple.systempolicy.managed</string>
	</array>
	<key>AllowMultiplePayloads</key>
	<false/>
	<key>ManifestContent</key>
	<array>
		<dict>
			<key>Required</key>
			<true/>
			<key>Identifier</key>
			<string>98B77AD6-60B9-477A-8EB1-8BAB7D59477B</string>
			<key>CellType</key>
			<string>SegmentedControl</string>
			<key>AvailableValues</key>
			<array>
				<string>General</string>
				<string>Privacy</string>
			</array>
			<key>ValueKeys</key>
			<dict>
				<key>General</key>
				<array>
					<dict>
						<key>Identifier</key>
						<string>9302D84F-B331-4C79-A93C-6C8AA6B5A1E9</string>
						<key>Title</key>
						<string>Do not allow user to override Gatekeeper setting</string>
						<key>Description</key>
						<string>Prevents the user from temporarily overriding the Gatekeeper setting by control-clicking to install any app</string>
						<key>PayloadType</key>
						<string>com.apple.systempolicy.managed</string>
						<key>PayloadKey</key>
						<string>DisableOverride</string>
						<key>CellType</key>
						<string>Checkbox</string>
						<key>ToolTipDescription</key>
						<string>FIXME</string>
					</dict>
					<dict>
						<key>Identifier</key>
						<string>F02E5130-79C6-45E0-9280-9A5774D197DA</string>
						<key>Title</key>
						<string>Allow user to change password</string>
						<key>FontWeight</key>
						<string>Regular</string>
						<key>CellType</key>
						<string>Checkbox</string>
						<key>ToolTipDescription</key>
						<string>FIXME</string>
						<key>ValueKeys</key>
						<dict>
							<key>True</key>
							<array>
								<dict>
									<key>PayloadKey</key>
									<string>ChangePasswordDisabled</string>
									<key>PayloadType</key>
									<string>com.apple.loginwindow</string>
								</dict>
								<dict>
									<key>PayloadKey</key>
									<string>dontAllowPasswordResetUI</string>
									<key>PayloadType</key>
									<string>com.apple.preference.security</string>
								</dict>
							</array>
						</dict>
					</dict>
					<dict>
						<key>Identifier</key>
						<string>5A403512-235E-4E8D-AC48-D1D5498F3D2F</string>
						<key>Title</key>
						<string>Require password after sleep or screen saver begins </string>
						<key>FontWeight</key>
						<string>Regular</string>
						<key>CellType</key>
						<string>PopUpButtonCheckbox</string>
						<key>ToolTipDescription</key>
						<string>FIXME</string>
						<key>AvailableValues</key>
						<array>
							<string>Immediately</string>
							<string>5 seconds</string>
							<string>1 minute</string>
							<string>5 minutes</string>
							<string>15 minutes</string>
							<string>1 hour</string>
							<string>4 hours</string>
							<string>8 hours</string>
						</array>
						<key>ValueKeys</key>
						<dict>
							<key>Immediately</key>
							<array>
								<dict>
									<key>PayloadValue</key>
									<real>0</real>
								</dict>
							</array>
						</dict>
					</dict>
					<dict>
						<key>Identifier</key>
						<string>69B5A1E2-27AD-4AF1-9A52-8B345F016210</string>
						<key>Title</key>
						<string>Allow user to set lock message</string>
						<key>FontWeight</key>
						<string>Regular</string>
						<key>PayloadType</key>
						<string>com.apple.preference.security</string>
						<key>PayloadKey</key>
						<string>dontAllowLockMessageUI</string>
						<key>CellType</key>
						<string>Checkbox</string>
						<key>ToolTipDescription</key>
						<string>FIXME</string>
					</dict>
				</array>
				<key>Privacy</key>
				<array>
					<dict>
						<key>Identifier</key>
						<string>E4C99282-4E8F-489C-8BE6-563D7F2960BE</string>
						<key>Title</key>
						<string>Send diagnostic &amp; usage data to Apple, and share crash data with app developers</string>
						<key>FontWeight</key>
						<string>Regular</string>
						<key>PayloadType</key>
						<string>com.apple.SubmitDiagInfo</string>
						<key>PayloadKey</key>
						<string>AutoSubmit</string>
						<key>CellType</key>
						<string>Checkbox</string>
						<key>DefaultValue</key>
						<true/>
						<key>ToolTipDescription</key>
						<string>FIXME</string>
					</dict>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
